11/data/attachments/45dcd0ef3778c54c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_f44feef8-80c9-46ad-b346-0d43c6c31f8f</nif:username>
            <nif:friendToBeAdded>Amy_majority_Friend_28116_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>